benchmarkingExperiments/data/initial_experiments/8t8c200rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  8 threads and 8 connections
  Thread calibration: mean lat.: 13.091ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 13.769ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.814ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 14.053ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 13.825ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 13.701ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 13.665ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.662ms, rate sampling interval: 39ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.17ms   11.32ms 129.28ms   93.61%
    Req/Sec    25.02      7.74    54.00     90.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.18ms
 75.000%   14.88ms
 90.000%   22.22ms
 99.000%   81.47ms
 99.900%  115.71ms
 99.990%  128.32ms
 99.999%  129.34ms
100.000%  129.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.583     0.000000            1         1.00
       7.811     0.100000         1003         1.11
       9.031     0.200000         2002         1.25
       9.991     0.300000         3005         1.43
      10.623     0.400000         4009         1.67
      11.175     0.500000         5011         2.00
      11.511     0.550000         5501         2.22
      11.959     0.600000         6000         2.50
      12.591     0.650000         6501         2.86
      13.559     0.700000         7005         3.33
      14.879     0.750000         7500         4.00
      15.583     0.775000         7752         4.44
      16.431     0.800000         8007         5.00
      17.567     0.825000         8250         5.71
      18.847     0.850000         8505         6.67
      20.207     0.875000         8751         8.00
      21.247     0.887500         8877         8.89
      22.223     0.900000         9000        10.00
      23.071     0.912500         9126        11.43
      24.223     0.925000         9250        13.33
      25.679     0.937500         9376        16.00
      26.575     0.943750         9440        17.78
      27.519     0.950000         9500        20.00
      28.687     0.956250         9563        22.86
      30.047     0.962500         9626        26.67
      31.823     0.968750         9688        32.00
      32.863     0.971875         9719        35.56
      34.175     0.975000         9750        40.00
      36.127     0.978125         9783        45.71
      40.031     0.981250         9813        53.33
      55.519     0.984375         9844        64.00
      62.975     0.985938         9860        71.11
      72.383     0.987500         9875        80.00
      78.591     0.989062         9891        91.43
      84.479     0.990625         9907       106.67
      89.023     0.992188         9922       128.00
      91.519     0.992969         9930       142.22
      94.655     0.993750         9938       160.00
      98.751     0.994531         9947       182.86
      99.967     0.995313         9954       213.33
     102.975     0.996094         9961       256.00
     103.615     0.996484         9965       284.44
     105.407     0.996875         9969       320.00
     107.135     0.997266         9973       365.71
     109.695     0.997656         9977       426.67
     110.911     0.998047         9981       512.00
     111.871     0.998242         9983       568.89
     112.895     0.998437         9985       640.00
     113.279     0.998633         9987       731.43
     113.791     0.998828         9989       853.33
     117.055     0.999023         9991      1024.00
     118.463     0.999121         9992      1137.78
     119.167     0.999219         9993      1280.00
     119.871     0.999316         9994      1462.86
     122.815     0.999414         9995      1706.67
     124.351     0.999512         9996      2048.00
     124.351     0.999561         9996      2275.56
     127.359     0.999609         9997      2560.00
     127.359     0.999658         9997      2925.71
     127.807     0.999707         9998      3413.33
     127.807     0.999756         9998      4096.00
     127.807     0.999780         9998      4551.11
     128.319     0.999805         9999      5120.00
     128.319     0.999829         9999      5851.43
     128.319     0.999854         9999      6826.67
     128.319     0.999878         9999      8192.00
     128.319     0.999890         9999      9102.22
     129.343     0.999902        10000     10240.00
     129.343     1.000000        10000          inf
#[Mean    =       14.166, StdDeviation   =       11.322]
#[Max     =      129.280, Total count    =        10000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12004 requests in 1.00m, 2.14MB read
Requests/sec:    200.03
Transfer/sec:     36.53KB